GopalSaraf/Practicals/PSDL/include/proc/pic16f15243.inc
// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 01FEEh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh
TOSL_TOSL0_POSN                          equ 0000h
TOSL_TOSL0_POSITION                      equ 0000h
TOSL_TOSL0_SIZE                          equ 0001h
TOSL_TOSL0_LENGTH                        equ 0001h
TOSL_TOSL0_MASK                          equ 0001h
TOSL_TOSL1_POSN                          equ 0001h
TOSL_TOSL1_POSITION                      equ 0001h
TOSL_TOSL1_SIZE                          equ 0001h
TOSL_TOSL1_LENGTH                        equ 0001h
TOSL_TOSL1_MASK                          equ 0002h
TOSL_TOSL2_POSN                          equ 0002h
TOSL_TOSL2_POSITION                      equ 0002h
TOSL_TOSL2_SIZE                          equ 0001h
TOSL_TOSL2_LENGTH                        equ 0001h
TOSL_TOSL2_MASK                          equ 0004h
TOSL_TOSL3_POSN                          equ 0003h
TOSL_TOSL3_POSITION                      equ 0003h
TOSL_TOSL3_SIZE                          equ 0001h
TOSL_TOSL3_LENGTH                        equ 0001h
TOSL_TOSL3_MASK                          equ 0008h
TOSL_TOSL4_POSN                          equ 0004h
TOSL_TOSL4_POSITION                      equ 0004h
TOSL_TOSL4_SIZE                          equ 0001h
TOSL_TOSL4_LENGTH                        equ 0001h
TOSL_TOSL4_MASK                          equ 0010h
TOSL_TOSL5_POSN                          equ 0005h
TOSL_TOSL5_POSITION                      equ 0005h
TOSL_TOSL5_SIZE                          equ 0001h
TOSL_TOSL5_LENGTH                        equ 0001h
TOSL_TOSL5_MASK                          equ 0020h
TOSL_TOSL6_POSN                          equ 0006h
TOSL_TOSL6_POSITION                      equ 0006h
TOSL_TOSL6_SIZE                          equ 0001h
TOSL_TOSL6_LENGTH                        equ 0001h
TOSL_TOSL6_MASK                          equ 0040h
TOSL_TOSL7_POSN                          equ 0007h
TOSL_TOSL7_POSITION                      equ 0007h
TOSL_TOSL7_SIZE                          equ 0001h
TOSL_TOSL7_LENGTH                        equ 0001h
TOSL_TOSL7_MASK                          equ 0080h

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 01FEFh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0008h
TOSH_TOSH_LENGTH                         equ 0008h
TOSH_TOSH_MASK                           equ 00FFh
TOSH_TOSH0_POSN                          equ 0000h
TOSH_TOSH0_POSITION                      equ 0000h
TOSH_TOSH0_SIZE                          equ 0001h
TOSH_TOSH0_LENGTH                        equ 0001h
TOSH_TOSH0_MASK                          equ 0001h
TOSH_TOSH1_POSN                          equ 0001h
TOSH_TOSH1_POSITION                      equ 0001h
TOSH_TOSH1_SIZE                          equ 0001h
TOSH_TOSH1_LENGTH                        equ 0001h
TOSH_TOSH1_MASK                          equ 0002h
TOSH_TOSH2_POSN                          equ 0002h
TOSH_TOSH2_POSITION                      equ 0002h
TOSH_TOSH2_SIZE                          equ 0001h
TOSH_TOSH2_LENGTH                        equ 0001h
TOSH_TOSH2_MASK                          equ 0004h
TOSH_TOSH3_POSN                          equ 0003h
TOSH_TOSH3_POSITION                      equ 0003h
TOSH_TOSH3_SIZE                          equ 0001h
TOSH_TOSH3_LENGTH                        equ 0001h
TOSH_TOSH3_MASK                          equ 0008h
TOSH_TOSH4_POSN                          equ 0004h
TOSH_TOSH4_POSITION                      equ 0004h
TOSH_TOSH4_SIZE                          equ 0001h
TOSH_TOSH4_LENGTH                        equ 0001h
TOSH_TOSH4_MASK                          equ 0010h
TOSH_TOSH5_POSN                          equ 0005h
TOSH_TOSH5_POSITION                      equ 0005h
TOSH_TOSH5_SIZE                          equ 0001h
TOSH_TOSH5_LENGTH                        equ 0001h
TOSH_TOSH5_MASK                          equ 0020h
TOSH_TOSH6_POSN                          equ 0006h
TOSH_TOSH6_POSITION                      equ 0006h
TOSH_TOSH6_SIZE                          equ 0001h
TOSH_TOSH6_LENGTH                        equ 0001h
TOSH_TOSH6_MASK                          equ 0040h
TOSH_TOSH7_POSN                          equ 0007h
TOSH_TOSH7_POSITION                      equ 0007h
TOSH_TOSH7_SIZE                          equ 0001h
TOSH_TOSH7_LENGTH                        equ 0001h
TOSH_TOSH7_MASK                          equ 0080h

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ABDEN                            BANKMASK(BAUD1CON), 0
#define ABDOVF                           BANKMASK(BAUD1CON), 7
#define ACKDT                            BANKMASK(SSP1CON2), 5
#define ACKDT1                           BANKMASK(SSP1CON2), 5
#define ACKEN                            BANKMASK(SSP1CON2), 4
#define ACKEN1                           BANKMASK(SSP1CON2), 4
#define ACKSTAT                          BANKMASK(SSP1CON2), 6
#define ACKSTAT1                         BANKMASK(SSP1CON2), 6
#define ACKTIM                           BANKMASK(SSP1CON3), 7
#define ADACTPPS0                        BANKMASK(ADACTPPS), 0
#define ADACTPPS1                        BANKMASK(ADACTPPS), 1
#define ADACTPPS2                        BANKMASK(ADACTPPS), 2
#define ADACTPPS3                        BANKMASK(ADACTPPS), 3
#define ADACTPPS4                        BANKMASK(ADACTPPS), 4
#define ADDEN                            BANKMASK(RC1STA), 3
#define ADFM                             BANKMASK(ADCON1), 7
#define ADFVR0                           BANKMASK(FVRCON), 0
#define ADFVR1                           BANKMASK(FVRCON), 1
#define ADGO                             BANKMASK(ADCON0), 1
#define ADIE                             BANKMASK(PIE1), 0
#define ADIF                             BANKMASK(PIR1), 0
#define ADMSK1                           BANKMASK(SSP1CON2), 1
#define ADMSK11                          BANKMASK(SSP1CON2), 1
#define ADMSK2                           BANKMASK(SSP1CON2), 2
#define ADMSK21                          BANKMASK(SSP1CON2), 2
#define ADMSK3                           BANKMASK(SSP1CON2), 3
#define ADMSK31                          BANKMASK(SSP1CON2), 3
#define ADMSK4                           BANKMASK(SSP1CON2), 4
#define ADMSK41                          BANKMASK(SSP1CON2), 4
#define ADMSK5                           BANKMASK(SSP1CON2), 5
#define ADMSK51                          BANKMASK(SSP1CON2), 5
#define ADOEN                            BANKMASK(OSCEN), 2
#define ADON                             BANKMASK(ADCON0), 0
#define ADOR                             BANKMASK(OSCSTAT), 2
#define AHEN                             BANKMASK(SSP1CON3), 1
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSA5                            BANKMASK(ANSELA), 5
#define ANSB4                            BANKMASK(ANSELB), 4
#define ANSB5                            BANKMASK(ANSELB), 5
#define ANSB6                            BANKMASK(ANSELB), 6
#define ANSB7                            BANKMASK(ANSELB), 7
#define ANSC0                            BANKMASK(ANSELC), 0
#define ANSC1                            BANKMASK(ANSELC), 1
#define ANSC2                            BANKMASK(ANSELC), 2
#define ANSC3                            BANKMASK(ANSELC), 3
#define ANSC4                            BANKMASK(ANSELC), 4
#define ANSC5                            BANKMASK(ANSELC), 5
#define ANSC6                            BANKMASK(ANSELC), 6
#define ANSC7                            BANKMASK(ANSELC), 7
#define ASYNC                            BANKMASK(T0CON1), 4
#define BCL1IE                           BANKMASK(PIE1), 2
#define BCL1IF                           BANKMASK(PIR1), 2
#define BF                               BANKMASK(SSP1STAT), 0
#define BF1                              BANKMASK(SSP1STAT), 0
#define BOEN                             BANKMASK(SSP1CON3), 4
#define BORRDY                           BANKMASK(BORCON), 0
#define BRG16                            BANKMASK(BAUD1CON), 3
#define BRGH                             BANKMASK(TX1STA), 2
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define BSR5                             BANKMASK(BSR), 5
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1
#define CCP1EN                           BANKMASK(CCP1CON), 7
#define CCP1FMT                          BANKMASK(CCP1CON), 4
#define CCP1IE                           BANKMASK(PIE1), 7
#define CCP1IF                           BANKMASK(PIR1), 7
#define CCP1MODE0                        BANKMASK(CCP1CON), 0
#define CCP1MODE1                        BANKMASK(CCP1CON), 1
#define CCP1MODE2                        BANKMASK(CCP1CON), 2
#define CCP1MODE3                        BANKMASK(CCP1CON), 3
#define CCP1OUT                          BANKMASK(CCP1CON), 5
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1
#define CCP2EN                           BANKMASK(CCP2CON), 7
#define CCP2FMT                          BANKMASK(CCP2CON), 4
#define CCP2IE                           BANKMASK(PIE2), 7
#define CCP2IF                           BANKMASK(PIR2), 7
#define CCP2MODE0                        BANKMASK(CCP2CON), 0
#define CCP2MODE1                        BANKMASK(CCP2CON), 1
#define CCP2MODE2                        BANKMASK(CCP2CON), 2
#define CCP2MODE3                        BANKMASK(CCP2CON), 3
#define CCP2OUT                          BANKMASK(CCP2CON), 5
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CKE                              BANKMASK(SSP1STAT), 6
#define CKE1                             BANKMASK(SSP1STAT), 6
#define CKP                              BANKMASK(SSP1CON1), 4
#define CKP1                             BANKMASK(SSP1CON1), 4
#define CKPOL                            BANKMASK(T2HLT), 6
#define CKPS3                            BANKMASK(T0CON1), 3
#define CKSYNC                           BANKMASK(T2HLT), 5
#define CPRDY                            BANKMASK(CPCON), 0
#define CPT                              BANKMASK(CPCON), 1
#define CREN                             BANKMASK(RC1STA), 4
#define CS                               BANKMASK(WDTCON), 7
#define CS3                              BANKMASK(T1CLK), 3
#define CSRC                             BANKMASK(TX1STA), 7
#define DA                               BANKMASK(SSP1STAT), 5
#define DA1                              BANKMASK(SSP1STAT), 5
#define DATA_ADDRESS                     BANKMASK(SSP1STAT), 5
#define DATA_ADDRESS1                    BANKMASK(SSP1STAT), 5
#define DC                               BANKMASK(STATUS), 1
#define DHEN                             BANKMASK(SSP1CON3), 0
#define D_A                              BANKMASK(SSP1STAT), 5
#define D_A1                             BANKMASK(SSP1STAT), 5
#define D_nA                             BANKMASK(SSP1STAT), 5
#define D_nA1                            BANKMASK(SSP1STAT), 5
#define FERR                             BANKMASK(RC1STA), 2
#define FM                               BANKMASK(ADCON1), 7
#define FREE                             BANKMASK(NVMCON1), 4
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRRDY                           BANKMASK(FVRCON), 6
#define GCEN                             BANKMASK(SSP1CON2), 7
#define GCEN1                            BANKMASK(SSP1CON2), 7
#define GGO                              BANKMASK(T1GCON), 3
#define GIE                              BANKMASK(INTCON), 7
#define GO                               BANKMASK(ADCON0), 1
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define GPOL                             BANKMASK(T1GCON), 6
#define GSPM                             BANKMASK(T1GCON), 4
#define GSS0                             BANKMASK(T1GATE), 0
#define GSS1                             BANKMASK(T1GATE), 1
#define GSS2                             BANKMASK(T1GATE), 2
#define GSS3                             BANKMASK(T1GATE), 3
#define GSS4                             BANKMASK(T1GATE), 4
#define GTM                              BANKMASK(T1GCON), 5
#define GVAL                             BANKMASK(T1GCON), 2
#define HFFRQ0                           BANKMASK(OSCFRQ), 0
#define HFFRQ1                           BANKMASK(OSCFRQ), 1
#define HFFRQ2                           BANKMASK(OSCFRQ), 2
#define HFOEN                            BANKMASK(OSCEN), 6
#define HFOR                             BANKMASK(OSCSTAT), 6
#define HFTUN0                           BANKMASK(OSCTUNE), 0
#define HFTUN1                           BANKMASK(OSCTUNE), 1
#define HFTUN2                           BANKMASK(OSCTUNE), 2
#define HFTUN3                           BANKMASK(OSCTUNE), 3
#define HFTUN4                           BANKMASK(OSCTUNE), 4
#define HFTUN5                           BANKMASK(OSCTUNE), 5
#define I2C_DAT                          BANKMASK(SSP1STAT), 5
#define I2C_DAT1                         BANKMASK(SSP1STAT), 5
#define I2C_READ                         BANKMASK(SSP1STAT), 2
#define I2C_READ1                        BANKMASK(SSP1STAT), 2
#define I2C_START                        BANKMASK(SSP1STAT), 3
#define I2C_START1                       BANKMASK(SSP1STAT), 3
#define I2C_STOP                         BANKMASK(SSP1STAT), 4
#define I2C_STOP2                        BANKMASK(SSP1STAT), 4
#define INLVLA0                          BANKMASK(INLVLA), 0
#define INLVLA1                          BANKMASK(INLVLA), 1
#define INLVLA2                          BANKMASK(INLVLA), 2
#define INLVLA3                          BANKMASK(INLVLA), 3
#define INLVLA4                          BANKMASK(INLVLA), 4
#define INLVLA5                          BANKMASK(INLVLA), 5
#define INLVLB4                          BANKMASK(INLVLB), 4
#define INLVLB5                          BANKMASK(INLVLB), 5
#define INLVLB6                          BANKMASK(INLVLB), 6
#define INLVLB7                          BANKMASK(INLVLB), 7
#define INLVLC0                          BANKMASK(INLVLC), 0
#define INLVLC1                          BANKMASK(INLVLC), 1
#define INLVLC2                          BANKMASK(INLVLC), 2
#define INLVLC3                          BANKMASK(INLVLC), 3
#define INLVLC4                          BANKMASK(INLVLC), 4
#define INLVLC5                          BANKMASK(INLVLC), 5
#define INLVLC6                          BANKMASK(INLVLC), 6
#define INLVLC7                          BANKMASK(INLVLC), 7
#define INTE                             BANKMASK(PIE0), 0
#define INTEDG                           BANKMASK(INTCON), 0
#define INTF                             BANKMASK(PIR0), 0
#define INTPPS0                          BANKMASK(INTPPS), 0
#define INTPPS1                          BANKMASK(INTPPS), 1
#define INTPPS2                          BANKMASK(INTPPS), 2
#define INTPPS3                          BANKMASK(INTPPS), 3
#define IOCAF0                           BANKMASK(IOCAF), 0
#define IOCAF1                           BANKMASK(IOCAF), 1
#define IOCAF2                           BANKMASK(IOCAF), 2
#define IOCAF3                           BANKMASK(IOCAF), 3
#define IOCAF4                           BANKMASK(IOCAF), 4
#define IOCAF5                           BANKMASK(IOCAF), 5
#define IOCAN0                           BANKMASK(IOCAN), 0
#define IOCAN1                           BANKMASK(IOCAN), 1
#define IOCAN2                           BANKMASK(IOCAN), 2
#define IOCAN3                           BANKMASK(IOCAN), 3
#define IOCAN4                           BANKMASK(IOCAN), 4
#define IOCAN5                           BANKMASK(IOCAN), 5
#define IOCAP0                           BANKMASK(IOCAP), 0
#define IOCAP1                           BANKMASK(IOCAP), 1
#define IOCAP2                           BANKMASK(IOCAP), 2
#define IOCAP3                           BANKMASK(IOCAP), 3
#define IOCAP4                           BANKMASK(IOCAP), 4
#define IOCAP5                           BANKMASK(IOCAP), 5
#define IOCBF4                           BANKMASK(IOCBF), 4
#define IOCBF5                           BANKMASK(IOCBF), 5
#define IOCBF6                           BANKMASK(IOCBF), 6
#define IOCBF7                           BANKMASK(IOCBF), 7
#define IOCBN4                           BANKMASK(IOCBN), 4
#define IOCBN5                           BANKMASK(IOCBN), 5
#define IOCBN6                           BANKMASK(IOCBN), 6
#define IOCBN7                           BANKMASK(IOCBN), 7
#define IOCBP4                           BANKMASK(IOCBP), 4
#define IOCBP5                           BANKMASK(IOCBP), 5
#define IOCBP6                           BANKMASK(IOCBP), 6
#define IOCBP7                           BANKMASK(IOCBP), 7
#define IOCCF0                           BANKMASK(IOCCF), 0
#define IOCCF1                           BANKMASK(IOCCF), 1
#define IOCCF2                           BANKMASK(IOCCF), 2
#define IOCCF3                           BANKMASK(IOCCF), 3
#define IOCCF4                           BANKMASK(IOCCF), 4
#define IOCCF5                           BANKMASK(IOCCF), 5
#define IOCCF6                           BANKMASK(IOCCF), 6
#define IOCCF7                           BANKMASK(IOCCF), 7
#define IOCCN0                           BANKMASK(IOCCN), 0
#define IOCCN1                           BANKMASK(IOCCN), 1
#define IOCCN2                           BANKMASK(IOCCN), 2
#define IOCCN3                           BANKMASK(IOCCN), 3
#define IOCCN4                           BANKMASK(IOCCN), 4
#define IOCCN5                           BANKMASK(IOCCN), 5
#define IOCCN6                           BANKMASK(IOCCN), 6
#define IOCCN7                           BANKMASK(IOCCN), 7
#define IOCCP0                           BANKMASK(IOCCP), 0
#define IOCCP1                           BANKMASK(IOCCP), 1
#define IOCCP2                           BANKMASK(IOCCP), 2
#define IOCCP3                           BANKMASK(IOCCP), 3
#define IOCCP4                           BANKMASK(IOCCP), 4
#define IOCCP5                           BANKMASK(IOCCP), 5
#define IOCCP6                           BANKMASK(IOCCP), 6
#define IOCCP7                           BANKMASK(IOCCP), 7
#define IOCIE                            BANKMASK(PIE0), 4
#define IOCIF                            BANKMASK(PIR0), 4
#define LATA0                            BANKMASK(LATA), 0
#define LATA1                            BANKMASK(LATA), 1
#define LATA2                            BANKMASK(LATA), 2
#define LATA3                            BANKMASK(LATA), 3
#define LATA4                            BANKMASK(LATA), 4
#define LATA5                            BANKMASK(LATA), 5
#define LATB4                            BANKMASK(LATB), 4
#define LATB5                            BANKMASK(LATB), 5
#define LATB6                            BANKMASK(LATB), 6
#define LATB7                            BANKMASK(LATB), 7
#define LATC0                            BANKMASK(LATC), 0
#define LATC1                            BANKMASK(LATC), 1
#define LATC2                            BANKMASK(LATC), 2
#define LATC3                            BANKMASK(LATC), 3
#define LATC4                            BANKMASK(LATC), 4
#define LATC5                            BANKMASK(LATC), 5
#define LATC6                            BANKMASK(LATC), 6
#define LATC7                            BANKMASK(LATC), 7
#define LFOEN                            BANKMASK(OSCEN), 4
#define LFOR                             BANKMASK(OSCSTAT), 4
#define LWLO                             BANKMASK(NVMCON1), 5
#define MD16                             BANKMASK(T0CON0), 4
#define MFOEN                            BANKMASK(OSCEN), 5
#define MFOR                             BANKMASK(OSCSTAT), 5
#define MODE4                            BANKMASK(T2HLT), 4
#define MSK01                            BANKMASK(SSP1ADD), 0
#define MSK11                            BANKMASK(SSP1ADD), 1
#define MSK21                            BANKMASK(SSP1ADD), 2
#define MSK31                            BANKMASK(SSP1ADD), 3
#define MSK41                            BANKMASK(SSP1ADD), 4
#define MSK51                            BANKMASK(SSP1ADD), 5
#define MSK61                            BANKMASK(SSP1ADD), 6
#define MSK71                            BANKMASK(SSP1ADD), 7
#define NDIV0                            BANKMASK(OSCCON), 0
#define NDIV1                            BANKMASK(OSCCON), 1
#define NDIV2                            BANKMASK(OSCCON), 2
#define NDIV3                            BANKMASK(OSCCON), 3
#define NOSC0                            BANKMASK(OSCCON), 4
#define NOSC1                            BANKMASK(OSCCON), 5
#define NOSC2                            BANKMASK(OSCCON), 6
#define NOT_DONE                         BANKMASK(T1GCON), 3
#define NOT_SYNC                         BANKMASK(T1CON), 2
#define NOT_T1DONE                       BANKMASK(T1GCON), 3
#define NOT_T1SYNC                       BANKMASK(T1CON), 2
#define NVMIE                            BANKMASK(PIE2), 6
#define NVMIF                            BANKMASK(PIR2), 6
#define NVMREGS                          BANKMASK(NVMCON1), 6
#define ODCA0                            BANKMASK(ODCONA), 0
#define ODCA1                            BANKMASK(ODCONA), 1
#define ODCA2                            BANKMASK(ODCONA), 2
#define ODCA4                            BANKMASK(ODCONA), 4
#define ODCA5                            BANKMASK(ODCONA), 5
#define ODCB4                            BANKMASK(ODCONB), 4
#define ODCB5                            BANKMASK(ODCONB), 5
#define ODCB6                            BANKMASK(ODCONB), 6
#define ODCB7                            BANKMASK(ODCONB), 7
#define ODCC0                            BANKMASK(ODCONC), 0
#define ODCC1                            BANKMASK(ODCONC), 1
#define ODCC2                            BANKMASK(ODCONC), 2
#define ODCC3                            BANKMASK(ODCONC), 3
#define ODCC4                            BANKMASK(ODCONC), 4
#define ODCC5                            BANKMASK(ODCONC), 5
#define ODCC6                            BANKMASK(ODCONC), 6
#define ODCC7                            BANKMASK(ODCONC), 7
#define OERR                             BANKMASK(RC1STA), 1
#define P1M1                             BANKMASK(CCP1CON), 7
